import sqlite3

# Создаем базу данных и подключаемся к ней
conn = sqlite3.connect('gifts.db')
cursor = conn.cursor()


# Создаем таблицу
cursor.execute('''
CREATE TABLE IF NOT EXISTS gifts (
    ФИО TEXT NOT NULL,
    Подарок TEXT NOT NULL,
    Стоимость REAL NOT NULL,
    Статус TEXT NOT NULL
)
''')

# Добавляем данные в таблицу
data = [
    ("Андрей Кузнецов", "Игровая консоль", 15000, "куплен"),
    ("Виктория Орлова", "Смарт-часы", 12000, "не куплен"),
    ("Павел Зайцев", "Наушники", 8000, "куплен"),
    ("Светлана Романова", "Электросамокат", 25000, "не куплен"),
    ("Георгий Волков", "Кофемашина", 18000, "куплен"),
    ("Лариса Белова", "Фотоаппарат", 20000, "куплен"),
    ("Роман Князев", "Робот-пылесос", 22000, "не куплен"),
    ("Оксана Тимофеева", "Электрогриль", 7000, "куплен"),
    ("Наталья Егорова", "Кухонный комбайн", 13000, "не куплен"),
    ("Степан Суханов", "Гитара", 15000, "не куплен")
]

cursor.executemany('''
INSERT INTO gifts (ФИО, Подарок, Стоимость, Статус)
VALUES (?, ?, ?, ?)
''', data)


conn.commit()

# Проверка
cursor.execute('SELECT * FROM gifts')
rows = cursor.fetchall()
for row in rows:
    print(row)

conn.close()